# Set arguments passed to all `brew install --cask` commands for `cask "..."`
cask_args appdir: "~/Applications", adopt: true

# CLI Tools
brew 'azure-cli'                    # Azure
brew 'Azure/kubelogin/kubelogin'    # K8s auth helper
brew 'cookiecutter'                 # Project templating
brew 'curl'                         # Data transfer
brew 'docker'                       # Containers
brew 'docker-compose'               # Containers
brew 'gh'                           # GitHub
brew 'git'                          # Version control
brew 'jq'                           # JSON processor
brew 'kubelogin'                    # K8s auth helper
brew 'kubernetes-cli'               # kubectl
brew 'mongocli'                     # MongoDB CLI
brew 'pyenv'                        # Python version manager
brew 'wget'                         # Data transfer
brew 'yq'                           # YAML processor

# Applications
cask '1password-cli'                # Password manager
cask '1password'                    # Password manager
cask 'bitwarden'                    # Password manager
cask 'caffeine'                     # Keep computer awake
cask 'docker-desktop'               # Docker GUI
cask 'freelens'                     # K8s IDE
cask 'gcloud-cli'                   # Google cloud
cask 'google-chrome'                # Web browser
cask 'intellij-idea'                # JVM IDE
cask 'jetbrains-toolbox'            # JetBrains IDE manager
cask 'loom'                         # Screen recording
cask 'microsoft-outlook'            # Email / calendar
cask 'microsoft-teams'              # Messaging
cask 'postman'                      # API testing
cask 'rectangle'                    # Window management
cask 'slack'                        # Messaging
cask 'spotify'                      # Music
cask 'studio-3t'                    # MongoDB IDE
cask 'visual-studio-code'           # General purpose IDE
cask 'zoom'                         # Video conferencing