# Set arguments passed to all `brew install --cask` commands for `cask "..."`
cask_args appdir: "~/Applications", adopt: true

# Taps
tao 'jakehilborn/jakehilborn'       # Display placer for Sunshine
tap 'LizardByte/homebrew'           # Sunshine
tap 'manaflow-ai/cmux'              # Terminal multiplexer

# CLI Tools
brew 'azure-cli'                    # Azure
brew 'Azure/kubelogin/kubelogin'    # K8s auth helper
brew 'cookiecutter'                 # Project templating
brew 'copilot-cli'                  # GitHub Copilot CLI
brew 'curl'                         # Data transfer
brew 'docker'                       # Containers
brew 'docker-compose'               # Containers
brew 'displayplacer'                # Display placer for Sunshine
brew 'deck'                         # Kong deck
brew 'fd'                           # File searching
brew 'gh'                           # GitHub
brew 'git'                          # Version control
brew 'git-delta'                    # Git diff viewer
brew 'gpg'                          # Encryption
brew 'jq'                           # JSON processor
brew 'kubelogin'                    # K8s auth helper
brew 'kubernetes-cli'               # kubectl
brew 'lazygit'                      # Git CLI UI
brew 'mkcert'                       # Local SSL certs
brew 'mongocli'                     # MongoDB CLI
brew 'nss'                          # Local SSL certs
brew 'pyenv'                        # Python version manager
brew 'ripgrep'                      # Code searching
brew 'scroll-reverser'              # Scroll direction manager
brew 'sunshine'                     # Game streaming host
brew 'wget'                         # Data transfer
brew 'yq'                           # YAML processor

# Applications
cask '1password-cli'                # Password manager
cask '1password'                    # Password manager
cask 'bitwarden'                    # Password manager
cask 'brave-browser'                # Web browser
cask 'caffeine'                     # Keep computer awake
cask 'cmux'                         # Terminal multiplexer
cask 'cursor'                       # AI IDE
cask 'claude-code'                  # AI assistant
cask 'docker-desktop'               # Docker GUI
cask 'freelens'                     # K8s IDE
cask 'gcloud-cli'                   # Google cloud
cask 'handy'                        # Speech to text
cask 'intellij-idea'                # JVM IDE
cask 'jetbrains-toolbox'            # JetBrains IDE manager
cask 'logi-options+'                # Logitech device manager
cask 'loom'                         # Screen recording
cask 'microsoft-outlook'            # Email / calendar
cask 'microsoft-teams'              # Messaging
cask 'postman'                      # API testing
cask 'raycast'                      # Launcher
cask 'rectangle'                    # Window management
cask 'slack'                        # Messaging
cask 'spotify'                      # Music
cask 'studio-3t'                    # MongoDB IDE
cask 'visual-studio-code'           # General purpose IDE
cask 'zoom'                         # Video conferencing